<?php

return [
    'student_required' => 'يرجى اختيار الطالب.',
    'student_exists'   => 'الطالب المختار غير موجود.',
    'type_required'    => 'يرجى إدخال نوع الملاحظة.',
    'type_string'      => 'نوع الملاحظة يجب أن يكون نصاً.',
    'type_in'         => 'نوع الملاحظة يجب أن يكون إيجابيا أو سلبيا',
    'reason_required'  => 'يرجى إدخال سبب الملاحظة.',
    'reason_string'    => 'السبب يجب أن يكون نصاً.',
    'reason_max'       => 'لا يجوز أن يتجاوز السبب :max حرفاً.',
    'reason_min'       => 'لا يجوز أن يقل السبب عن :min حرفاً.',
    'created'          => 'تم إنشاء الملاحظة بنجاح.',
    'server_error'     => 'حدث خطأ غير متوقع , الرجاء المحاولة لاحقا',
];
